Revit 2027 API
BuiltInFailures.SlabShapeFailures.SlabShapeWarnVerticesCoincident Property
 Some slab shape edit vertices were too close to each other or too close to an edge.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SlabShapeWarnVerticesCoincident { get; }
Public Shared ReadOnly Property SlabShapeWarnVerticesCoincident As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SlabShapeWarnVerticesCoincident {
	FailureDefinitionId^ get ();
}
static member SlabShapeWarnVerticesCoincident : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SlabShapeFailures Class
Autodesk.Revit.DB Namespace